---
kind: enumMember
id: F:Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment.FullyAligned
enum: Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment
source: html/b5528756-9d84-ab2f-5f66-b8cf1e9e3536.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment.FullyAligned

The face is fully aligned with faces of the extrusion.